VHEMaster/AutoECUv2/AutoECUv2.ioc
PE13.GPIO_PuPd=GPIO_PULLDOWN
PE13.Locked=true
PE13.PinAttribute=CortexM7
PE13.Signal=GPXTI13
PE14.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PE14.GPIO_Label=OUTS1_CH4
PE14.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE14.Locked=true
PE14.PinAttribute=CortexM7
PE14.Signal=S_TIM1_CH4
PE4.ContextOwner=CortexM7
PE4.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PE4.GPIO_Label=LAMBDA_HEATER_NEN
PE4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE4.Locked=true
PE4.PinAttribute=CortexM7
PE4.PinState=GPIO_PIN_SET
PE4.Signal=GPIO_Output
PE5.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PE5.GPIO_Label=LAMBDA1_HEATER
PE5.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE5.Locked=true
PE5.PinAttribute=CortexM7
PE5.Signal=S_TIM15_CH1
PE6.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PE6.GPIO_Label=LAMBDA2_HEATER
PE6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE6.Locked=true
PE6.PinAttribute=CortexM7
PE6.Signal=S_TIM15_CH2
PE7.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE7.GPIO_PuPd=GPIO_PULLUP
PE7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE7.Locked=true
PE7.Mode=Dual_Bank
PE7.PinAttribute=CortexM7
PE7.Signal=QUADSPI_BK2_IO0
PE8.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE8.GPIO_PuPd=GPIO_PULLUP
PE8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE8.Locked=true
PE8.Mode=Dual_Bank
PE8.PinAttribute=CortexM7
PE8.Signal=QUADSPI_BK2_IO1
PE9.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE9.GPIO_PuPd=GPIO_PULLUP
PE9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE9.Locked=true
PE9.Mode=Dual_Bank
PE9.PinAttribute=CortexM7
PE9.Signal=QUADSPI_BK2_IO2
PF0.ContextOwner=CortexM7
PF0.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF0.GPIO_Label=IGN_CH5
PF0.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF0.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF0.Locked=true
PF0.PinAttribute=CortexM7
PF0.PinState=GPIO_PIN_RESET
PF0.Signal=GPIO_Output
PF1.ContextOwner=CortexM7
PF1.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF1.GPIO_Label=IGN_CH6
PF1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF1.Locked=true
PF1.PinAttribute=CortexM7
PF1.PinState=GPIO_PIN_RESET
PF1.Signal=GPIO_Output
PF10.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF10.GPIO_PuPd=GPIO_PULLUP
PF10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF10.Locked=true
PF10.Mode=Dual_Bank
PF10.PinAttribute=CortexM7
PF10.Signal=QUADSPI_CLK
PF11.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF11.GPIO_PuPd=GPIO_PULLUP
PF11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF11.Locked=true
PF11.Mode=Full_Duplex_Master
PF11.PinAttribute=CortexM7
PF11.Signal=SPI5_MOSI
PF12.ContextOwner=CortexM7
PF12.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF12.GPIO_Label=IGN_CH1
PF12.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF12.Locked=true
PF12.PinAttribute=CortexM7
PF12.PinState=GPIO_PIN_RESET
PF12.Signal=GPIO_Output
PF13.ContextOwner=CortexM7
PF13.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF13.GPIO_Label=IGN_CH2
PF13.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF13.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF13.Locked=true
PF13.PinAttribute=CortexM7
PF13.PinState=GPIO_PIN_RESET
PF13.Signal=GPIO_Output
PF14.ContextOwner=CortexM7
PF14.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF14.GPIO_Label=IGN_CH3
PF14.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF14.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF14.Locked=true
PF14.PinAttribute=CortexM7
PF14.PinState=GPIO_PIN_RESET
PF14.Signal=GPIO_Output
PF15.ContextOwner=CortexM7
PF15.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF15.GPIO_Label=IGN_CH4
PF15.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF15.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF15.Locked=true
PF15.PinAttribute=CortexM7
PF15.PinState=GPIO_PIN_RESET
PF15.Signal=GPIO_Output
PF2.ContextOwner=CortexM7
PF2.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF2.GPIO_Label=IGN_CH7
PF2.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF2.Locked=true
PF2.PinAttribute=CortexM7
PF2.PinState=GPIO_PIN_RESET
PF2.Signal=GPIO_Output
PF3.ContextOwner=CortexM7
PF3.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PF3.GPIO_Label=IGN_CH8
PF3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PF3.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF3.Locked=true
PF3.PinAttribute=CortexM7
PF3.PinState=GPIO_PIN_RESET
PF3.Signal=GPIO_Output
PF4.ContextOwner=CortexM7
PF4.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PF4.GPIO_Label=MOTOR1_DIR
PF4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF4.Locked=true
PF4.PinAttribute=CortexM7
PF4.PinState=GPIO_PIN_SET
PF4.Signal=GPIO_Output
PF5.ContextOwner=CortexM7
PF5.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PF5.GPIO_Label=MOTOR2_DIR
PF5.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF5.Locked=true
PF5.PinAttribute=CortexM7
PF5.PinState=GPIO_PIN_SET
PF5.Signal=GPIO_Output
PF6.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF6.GPIO_PuPd=GPIO_PULLUP
PF6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF6.Locked=true
PF6.Mode=Dual_Bank
PF6.PinAttribute=CortexM7
PF6.Signal=QUADSPI_BK1_IO3
PF7.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF7.GPIO_PuPd=GPIO_PULLUP
PF7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF7.Locked=true
PF7.Mode=Dual_Bank
PF7.PinAttribute=CortexM7
PF7.Signal=QUADSPI_BK1_IO2
PF8.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF8.GPIO_PuPd=GPIO_PULLUP
PF8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF8.Locked=true
PF8.Mode=Dual_Bank
PF8.PinAttribute=CortexM7
PF8.Signal=QUADSPI_BK1_IO0
PF9.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF9.GPIO_PuPd=GPIO_PULLUP
PF9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF9.Locked=true
PF9.Mode=Dual_Bank
PF9.PinAttribute=CortexM7
PF9.Signal=QUADSPI_BK1_IO1
PG0.ContextOwner=CortexM7
PG0.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG0.GPIO_Label=SPI5_NSS_OUTSM1
PG0.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG0.Locked=true
PG0.PinAttribute=CortexM7
PG0.PinState=GPIO_PIN_SET
PG0.Signal=GPIO_Output
PG1.ContextOwner=CortexM7
PG1.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG1.GPIO_Label=SPI5_NSS_OUTSM2
PG1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG1.Locked=true
PG1.PinAttribute=CortexM7
PG1.PinState=GPIO_PIN_SET
PG1.Signal=GPIO_Output
PG10.ContextOwner=CortexM7
PG10.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG10.GPIO_Label=SPI6_NSS_LAMBDA1
PG10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG10.Locked=true
PG10.PinAttribute=CortexM7
PG10.PinState=GPIO_PIN_SET
PG10.Signal=GPIO_Output
PG11.ContextOwner=CortexM7
PG11.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG11.GPIO_Label=OUTS_RESET
PG11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG11.Locked=true
PG11.PinAttribute=CortexM7
PG11.PinState=GPIO_PIN_RESET
PG11.Signal=GPIO_Output
PG12.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PG12.GPIO_PuPd=GPIO_PULLUP
PG12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG12.Locked=true
PG12.Mode=Full_Duplex_Master
PG12.PinAttribute=CortexM7
PG12.Signal=SPI6_MISO
PG13.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PG13.GPIO_PuPd=GPIO_PULLDOWN
PG13.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG13.Locked=true
PG13.Mode=Full_Duplex_Master
PG13.PinAttribute=CortexM7
PG13.Signal=SPI6_SCK
PG14.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PG14.GPIO_PuPd=GPIO_PULLUP
PG14.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG14.Locked=true
PG14.Mode=Full_Duplex_Master
PG14.PinAttribute=CortexM7
PG14.Signal=SPI6_MOSI
PG15.ContextOwner=CortexM7
PG15.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG15.GPIO_Label=SPI6_NSS_LAMBDA2
PG15.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG15.Locked=true
PG15.PinAttribute=CortexM7
PG15.PinState=GPIO_PIN_SET
PG15.Signal=GPIO_Output
PG2.ContextOwner=CortexM7
PG2.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG2.GPIO_Label=SPI5_NSS_OUTS1
PG2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG2.Locked=true
PG2.PinAttribute=CortexM7
PG2.PinState=GPIO_PIN_SET
PG2.Signal=GPIO_Output
PG3.ContextOwner=CortexM7
PG3.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PG3.GPIO_Label=SPI5_NSS_OUTS2
PG3.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PG3.Locked=true
PG3.PinAttribute=CortexM7
PG3.PinState=GPIO_PIN_SET
PG3.Signal=GPIO_Output
PG4.ContextOwner=CortexM7
PG4.GPIOParameters=GPIO_Label,PinAttribute
PG4.GPIO_Label=FLEXIO2_SENT1
PG4.Locked=true
PG4.PinAttribute=CortexM7
PG4.Signal=GPXTI4
PG5.ContextOwner=CortexM7
PG5.GPIOParameters=GPIO_Label,PinAttribute
PG5.GPIO_Label=FLEXIO2_SENT2
PG5.Locked=true
PG5.PinAttribute=CortexM7
PG5.Signal=GPXTI5
PG6.ContextOwner=CortexM7
PG6.GPIOParameters=GPIO_Label,PinAttribute
PG6.GPIO_Label=FLEXIO2_SENT3
PG6.Locked=true
PG6.PinAttribute=CortexM7
PG6.Signal=GPXTI6
PG7.ContextOwner=CortexM7
PG7.GPIOParameters=GPIO_Label,PinAttribute
PG7.GPIO_Label=FLEXIO2_SENT4
PG7.Locked=true
PG7.PinAttribute=CortexM7
PG7.Signal=GPXTI7
PG8.ContextOwner=CortexM7
PG8.GPIOParameters=GPIO_Label,PinAttribute
PG8.GPIO_Label=LAMBDA_NRST
PG8.Locked=true
PG8.PinAttribute=CortexM7
PG8.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).GPIOParameters=PinAttribute
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN\ (PH0).PinAttribute=Free
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT\ (PH1).GPIOParameters=PinAttribute
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT\ (PH1).PinAttribute=Free
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PJ10.ContextOwner=CortexM7
PJ10.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PJ10.GPIO_Label=FLEXIO2_WAKE
PJ10.GPIO_PuPd=GPIO_PULLDOWN
PJ10.Locked=true
PJ10.PinAttribute=CortexM7
PJ10.Signal=GPXTI10
PJ11.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PJ11.GPIO_PuPd=GPIO_PULLUP
PJ11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ11.Locked=true
PJ11.Mode=Full_Duplex_Master
PJ11.PinAttribute=CortexM7
PJ11.Signal=SPI5_MISO
PJ8.ContextOwner=CortexM7
PJ8.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PJ8.GPIO_Label=FLEXIO1_WAKE
PJ8.GPIO_PuPd=GPIO_PULLDOWN
PJ8.Locked=true
PJ8.PinAttribute=CortexM7
PJ8.Signal=GPIO_Output
PJ9.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PJ9.GPIO_Label=OUTS1_CH3
PJ9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ9.Locked=true
PJ9.PinAttribute=CortexM7
PJ9.Signal=S_TIM1_CH3
PK0.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PK0.GPIO_PuPd=GPIO_PULLDOWN
PK0.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PK0.Locked=true
PK0.Mode=Full_Duplex_Master
PK0.PinAttribute=CortexM7
PK0.Signal=SPI5_SCK
PK1.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PK1.GPIO_Label=OUTS1_CH1
PK1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PK1.Locked=true
PK1.PinAttribute=CortexM7
PK1.Signal=S_TIM1_CH1
PK2.ContextOwner=CortexM7
PK2.GPIOParameters=GPIO_Speed,PinState,GPIO_Label,PinAttribute
PK2.GPIO_Label=KNOCK_INT
PK2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PK2.Locked=true
PK2.PinAttribute=CortexM7
PK2.PinState=GPIO_PIN_RESET
PK2.Signal=GPIO_Output
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.BootMode=boot0
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H745IITx
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.11.1
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=M4-0x2000,M7-0x2000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=false
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=AutoECUv2.ioc
ProjectManager.ProjectName=AutoECUv2
ProjectManager.ProjectStructure=M7\:Non Secure Project\:true;M4\:Non Secure Project\:true;
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=M4-0x4000,M7-0x4000
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false-CortexM7,2-MX_GPIO_Init-GPIO-false-HAL-true-CortexM7,3-MX_DMA_Init-DMA-false-HAL-true-CortexM7,4-MX_MDMA_Init-MDMA-false-HAL-true-CortexM7,5-MX_SPI2_Init-SPI2-false-HAL-true-CortexM7,6-MX_SPI3_Init-SPI3-false-HAL-true-CortexM7,7-MX_QUADSPI_Init-QUADSPI-false-HAL-true-CortexM7,8-MX_SPI6_Init-SPI6-false-HAL-true-CortexM7,9-MX_RTC_Init-RTC-false-HAL-true-CortexM7,10-MX_IWDG1_Init-IWDG1-false-HAL-true-CortexM7,11-MX_TIM15_Init-TIM15-false-HAL-true-CortexM7,12-MX_USART3_UART_Init-USART3-false-HAL-true-CortexM7,13-MX_ADC1_Init-ADC1-false-HAL-true-CortexM7,14-MX_TIM1_Init-TIM1-false-HAL-true-CortexM7,15-MX_TIM16_Init-TIM16-false-HAL-true-CortexM7,16-MX_TIM17_Init-TIM17-false-HAL-true-CortexM7,17-MX_DAC1_Init-DAC1-false-HAL-true-CortexM7,18-MX_SPI5_Init-SPI5-false-HAL-true-CortexM7,19-MX_TIM2_Init-TIM2-false-HAL-true-CortexM7,20-MX_TIM3_Init-TIM3-false-HAL-true-CortexM7,21-MX_TIM4_Init-TIM4-false-HAL-true-CortexM7,22-MX_TIM5_Init-TIM5-false-HAL-true-CortexM7,23-MX_TIM8_Init-TIM8-false-HAL-true-CortexM7,24-MX_TIM12_Init-TIM12-false-HAL-true-CortexM7,25-MX_TIM13_Init-TIM13-false-HAL-true-CortexM7,26-MX_TIM14_Init-TIM14-false-HAL-true-CortexM7,27-MX_CRC_Init-CRC-false-HAL-true-CortexM7,28-MX_FDCAN1_Init-FDCAN1-false-HAL-true-CortexM7,29-MX_USART1_UART_Init-USART1-false-HAL-true-CortexM7,30-MX_TIM6_Init-TIM6-false-HAL-true-CortexM7,31-MX_TIM7_Init-TIM7-false-HAL-true-CortexM7,1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM4,2-MX_DMA_Init-DMA-false-HAL-true-CortexM4,3-MX_MDMA_Init-MDMA-false-HAL-true-CortexM4,4-MX_RTC_Init-RTC-true-HAL-false-CortexM4,5-MX_IWDG2_Init-IWDG2-false-HAL-true-CortexM4,6-MX_CRC_Init-CRC-true-HAL-false-CortexM4,7-MX_FREERTOS_Init-FREERTOS_M4-false-HAL-false-CortexM4,8-MX_USB_DEVICE_Init-USB_DEVICE_M4-false-HAL-false-CortexM4,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true-CortexM7,0-MX_VREFBUF_Init-VREFBUF-false-HAL-true-CortexM7,0-MX_CORTEX_M4_Init-CORTEX_M4-false-HAL-true-CortexM4,0-MX_VREFBUF_Init-VREFBUF-true-HAL-false-CortexM4
QUADSPI.ClockPrescaler=3-1
QUADSPI.IPParameters=ClockPrescaler
RCC.ADCFreq_Value=80000000
RCC.AHB12Freq_Value=240000000
RCC.AHB4Freq_Value=240000000
RCC.APB1Freq_Value=120000000
RCC.APB2Freq_Value=120000000
RCC.APB3Freq_Value=120000000
RCC.APB4Freq_Value=120000000
RCC.AXIClockFreq_Value=240000000
RCC.CECFreq_Value=32000
RCC.CKPERFreq_Value=64000000
RCC.CPU2Freq_Value=240000000
RCC.CPU2SystikFreq_Value=240000000
RCC.CortexFreq_Value=480000000
RCC.CpuClockFreq_Value=480000000
RCC.D1CPREFreq_Value=480000000
RCC.D1PPRE=RCC_APB3_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D3PPRE=RCC_APB4_DIV2
RCC.DFSDMACLkFreq_Value=96000000
RCC.DFSDMFreq_Value=120000000
RCC.DIVM1=5
RCC.DIVM2=25
RCC.DIVM3=25
RCC.DIVN1=192
RCC.DIVN2=240
RCC.DIVN3=192
RCC.DIVP1Freq_Value=480000000
RCC.DIVP2=3
RCC.DIVP2Freq_Value=80000000
RCC.DIVP3Freq_Value=96000000
RCC.DIVQ1=10
RCC.DIVQ1Freq_Value=96000000
RCC.DIVQ2=3
RCC.DIVQ2Freq_Value=80000000
RCC.DIVQ3=3
RCC.DIVQ3Freq_Value=64000000
RCC.DIVR1Freq_Value=480000000
RCC.DIVR2Freq_Value=120000000
RCC.DIVR3=1
RCC.DIVR3Freq_Value=192000000
RCC.FDCANCLockSelection=RCC_FDCANCLKSOURCE_PLL2
RCC.FDCANFreq_Value=80000000
RCC.FMCFreq_Value=240000000
RCC.FamilyName=M
RCC.HCLK3ClockFreq_Value=240000000
RCC.HCLKFreq_Value=240000000
RCC.HPRE=RCC_HCLK_DIV2
RCC.HRTIMFreq_Value=240000000
RCC.HSE_VALUE=25000000
RCC.I2C123Freq_Value=120000000
RCC.I2C4Freq_Value=120000000
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CPU2Freq_Value,CPU2SystikFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,FDCANCLockSelection,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LSE_VALUE,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLSourceVirtual,QSPICLockSelection,QSPIFreq_Value,RCC_MCO1Source,RCC_MCODiv1,RCC_TIM_PRescaler_Selection,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123CLockSelection,SPI123Freq_Value,SPI45Freq_Value,SPI6CLockSelection,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Spi45ClockSelection,SupplySource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VDD_VALUE
RCC.LPTIM1Freq_Value=120000000
RCC.LPTIM2Freq_Value=120000000
RCC.LPTIM345Freq_Value=120000000
RCC.LPUART1Freq_Value=120000000
RCC.LSE_VALUE=0
RCC.LTDCFreq_Value=192000000
RCC.MCO1PinFreq_Value=6400000
RCC.MCO2PinFreq_Value=480000000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.QSPICLockSelection=RCC_QSPICLKSOURCE_PLL
RCC.QSPIFreq_Value=96000000
RCC.RCC_MCO1Source=RCC_MCO1SOURCE_PLL1QCLK
RCC.RCC_MCODiv1=RCC_MCODIV_15
RCC.RCC_TIM_PRescaler_Selection=RCC_TIMPRES_DESACTIVATED
RCC.RNGFreq_Value=48000000
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
RCC.RTCFreq_Value=0
RCC.SAI1Freq_Value=96000000
RCC.SAI23Freq_Value=96000000
RCC.SAI4AFreq_Value=96000000
RCC.SAI4BFreq_Value=96000000
RCC.SDMMCFreq_Value=96000000
RCC.SPDIFRXFreq_Value=96000000
RCC.SPI123CLockSelection=RCC_SPI123CLKSOURCE_PLL2
RCC.SPI123Freq_Value=80000000
RCC.SPI45Freq_Value=80000000
RCC.SPI6CLockSelection=RCC_SPI6CLKSOURCE_PLL3
RCC.SPI6Freq_Value=64000000
RCC.SWPMI1Freq_Value=120000000
RCC.SYSCLKFreq_VALUE=480000000
